In [1]:
import pandas as pd
import numpy as np

In [3]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

CREATE INDEX

In [4]:
import random

In [7]:
#create non repetetive values for the index
new_index = np.arange(0,1000)

In [ ]:
#shuffle
random.shuffle(new_index)

In [10]:
new_index

array([524,   7, 439, 710, 785, 131, 574, 361, 407, 559, 817, 792, 191,
       160, 319, 643, 487, 631, 376,  13, 941,  79, 683, 482, 261, 295,
       438, 479, 314, 288, 718, 532, 323, 788, 784, 609, 168, 746, 545,
       888, 735, 622,  72, 414, 279, 871, 371, 677, 370, 503, 375, 770,
        17, 291,  15, 573, 956, 179, 751, 365, 931, 190, 546, 883, 924,
       864, 847, 899, 239, 916, 230, 250, 978, 615, 422, 247, 362, 526,
       208, 451,  70, 233, 527, 617, 164, 453, 925, 277, 644, 742, 560,
       281, 260,  32, 257, 985, 389, 342, 877, 595, 848, 512, 672, 140,
       777, 961,  88, 470, 612, 464, 889, 666,  14, 533, 236, 755, 354,
       379, 430, 811, 757, 504, 854, 913, 579, 810, 972, 468, 505, 565,
       315, 603, 583, 676, 413, 717, 537, 273, 248,  91, 549, 299, 429,
       823, 897, 112, 259, 115, 308, 241, 997,  59, 880, 780, 604, 157,
       750, 640, 923, 576,  27, 217, 377, 463, 272, 326, 614, 698, 158,
       474, 515, 100, 764, 901, 821,  56, 263, 539,  77, 730, 373, 865,
       287, 153, 805, 268, 495, 661, 711, 204, 607, 767, 601, 378, 678,
       500, 258, 118, 410, 253, 898, 977, 193, 293, 645, 571,  45, 918,
       790, 582, 947, 700, 962, 570,  62, 922, 302, 350, 294, 374, 455,
       165, 934, 353, 467, 772, 431, 498, 963, 714,  80, 285,  99, 744,
       806,  65, 605, 349, 387, 600, 509, 840, 519, 122, 572, 289, 435,
       769, 886, 434, 363, 173,  19, 919, 664, 705, 383, 254, 310, 621,
       728, 426, 271, 198, 156, 548, 331, 776, 841, 733, 992, 866, 304,
       486, 364,  48, 138,  43, 740, 861, 328, 398, 702, 343, 599, 454,
       647, 747, 827, 313, 689, 459, 477, 657, 228, 534, 639, 316, 329,
        86,  60, 697, 943, 249,  30, 547, 651, 382,  41, 966, 189, 688,
       986, 725, 826, 412, 456, 380, 137, 252, 135, 625,   0, 411, 882,
       222, 290, 465, 859, 675,   5, 243, 510,  55,  34, 121, 489, 338,
       240, 201, 987, 325, 126, 167, 969, 186, 885, 641, 673, 687, 491,
       496, 111, 891, 995, 902, 415, 970,  22, 701, 867, 220, 562, 650,
       727, 427, 508, 395, 492, 828, 945, 602, 829, 738, 814, 132, 276,
       846,  33,  57, 450, 359, 619, 321, 610,   3, 795, 680, 120, 723,
       862, 793, 849,  96, 968, 832, 232, 892, 333, 394, 674, 563, 264,
       322, 802, 335, 330, 237, 119, 642, 270, 598, 162, 488, 950, 542,
       481, 809, 177, 101, 523,  52, 443, 979, 521, 556, 152, 914, 804,
       292, 267, 139, 102, 590,  44, 105, 752, 409, 900, 653, 879,  82,
       988, 108, 989, 638, 408, 813, 736, 203, 852, 150, 878, 990, 404,
       753, 251, 341, 103, 518, 457, 200, 589, 839, 663, 346, 478, 611,
        23,  78, 581, 838, 998, 637, 425, 213, 324, 890, 803, 685, 834,
       347, 791, 782, 552,  54, 669, 306, 282,  16,   8, 952, 783, 732,
         9, 911, 958, 903, 471, 405,  92, 981, 626, 501, 837, 127, 225,
       544, 597, 624,  40, 558, 759, 720, 195, 937, 564, 938, 337, 224,
       665, 327, 789, 494, 926, 835, 298, 851, 662, 756, 446, 649, 585,
       623,  24, 475, 146, 907, 855,  90, 984,   6, 927, 951,  66,  74,
       954,  87, 786, 234, 876, 794, 909, 734, 568,  84, 696, 286, 566,
       587, 929, 210, 569,  29, 652, 351, 704,  50, 812, 155,  93, 301,
       181,  12, 393,  26, 993, 577, 608, 818, 999, 715, 636, 161, 716,
        63, 466, 269, 366, 215, 256, 472, 627, 856, 433, 205, 390, 188,
        37, 392, 447, 406, 136, 693,  75, 497, 176, 166, 766, 275, 530,
       975, 875, 369,  49,   1, 949, 180, 356, 344, 385, 175, 928, 976,
       538, 904, 915, 307, 113, 386, 514, 774, 209, 106, 670,  68, 345,
       485, 211, 480, 401, 682, 399, 110, 147, 528,  71, 762, 332, 445,
       729, 423, 870, 255, 536, 722,  95, 419, 745, 749, 216, 586, 554,
       517, 833, 933, 635, 339, 442, 206,  97, 706,  36, 525,  46,  28,
       174, 726, 462, 606, 303,  94, 441, 618,  64, 695,  89, 229, 775,
       416, 781, 779,  53, 107, 596, 555, 529,  31,   2, 932, 143, 142,
       906, 761, 815, 800, 499, 917, 584, 367, 397, 684, 831, 391, 278,
       557, 965,  98, 872, 830, 218, 368, 648,  76, 739,  47,  58, 178,
       959, 400, 516, 850, 860, 522, 305,  73, 283, 473, 808, 561,  67,
       646, 452, 280, 940, 957, 244, 541, 896, 437, 214, 893, 632, 484,
       905, 801, 858, 194, 384, 912, 721, 246, 613, 231, 771, 320, 580,
       754, 336, 920, 996, 238, 921,  21, 284, 944,  25, 593, 141, 245,
       712, 930, 942, 340, 424, 836, 575, 117, 939, 196, 588,  85, 983,
       183,  38, 629, 567, 185, 654,   4, 743, 953, 796, 449, 946, 130,
       124, 149, 134, 719, 874, 703, 171, 114, 758, 151, 128, 129, 207,
       824, 242, 724, 691, 908, 318, 694, 708, 154, 169, 550, 982, 936,
       797, 274, 974, 436, 221, 845,  61, 133, 659, 531, 187, 227, 357,
       692, 360, 458, 853, 172, 159, 148, 540, 184, 667, 656, 973,  35,
       591, 192, 493, 104, 971, 125, 887,  10,  51, 857, 707, 420, 765,
       686, 309, 807, 507, 460, 630, 798, 994, 658, 352, 448, 109, 199,
       842, 964, 910, 502, 869, 317, 594, 520, 182, 145, 372, 690, 741,
       535, 633,  39, 511, 296, 116, 873, 444, 773, 163, 235,  18, 440,
       476, 592, 967, 679, 262, 311, 819,  42, 358, 894,  20, 348, 681,
       881, 223, 226, 123, 396, 170, 212, 421, 432, 816, 935, 543, 628,
       483, 778, 461, 948, 843,  69, 417, 713, 868, 787, 825, 553, 202,
       884, 822, 660, 490, 731, 219, 578, 513, 620, 297, 616, 266, 418,
        81,  11, 760, 820, 863, 551, 668, 991, 402, 506, 748, 980, 655,
       737, 144, 355, 634, 469, 312, 428, 265, 671, 895, 763, 799, 388,
        83, 844, 197, 334, 381, 960, 955, 699, 768, 709, 300, 403])

In [11]:
#create new column with new index
df_exams['new_index'] = new_index

In [12]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new_index
0,female,group B,bachelor's degree,standard,none,72,72,74,524
1,female,group C,some college,standard,completed,69,90,88,7
2,female,group B,master's degree,standard,none,90,95,93,439
3,male,group A,associate's degree,free/reduced,none,47,57,44,710
4,male,group C,some college,standard,none,76,78,75,785

SET INDEX

In [16]:
#set the new_index as the new index of the data frame
df_exams.set_index('new_index',inplace=True)

KeyError: "None of ['new_index'] are in the columns"

In [17]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new_index,,,,,,,,
524,female,group B,bachelor's degree,standard,none,72,72,74
7,female,group C,some college,standard,completed,69,90,88
439,female,group B,master's degree,standard,none,90,95,93
710,male,group A,associate's degree,free/reduced,none,47,57,44
785,male,group C,some college,standard,none,76,78,75

SORT INDEX

In [20]:
df_exams.sort_index(ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new_index,,,,,,,,
999,female,group D,some high school,standard,none,81,97,96
998,female,group C,associate's degree,standard,completed,68,86,84
997,male,group A,some high school,standard,completed,62,67,69
996,male,group B,high school,standard,none,52,48,49
995,female,group C,some college,standard,none,59,71,70
...,...,...,...,...,...,...,...,...
4,female,group C,associate's degree,standard,none,52,55,57
3,female,group E,some college,standard,none,67,76,75
2,female,group D,associate's degree,standard,completed,57,78,79
1,female,group C,high school,standard,none,60,68,72
0,female,group C,some college,standard,none,71,81,80

Rename a column